app/controllers/api/v1/images_controller.rb

    def index
        render json: Image.all
---
SELECT "images".* FROM "images"