app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
    def index

        render json: User.all, include: '**'

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2019-07-02 21:06:02.932179"], ["updated_at", "2019-07-02 21:06:02.932179"]]
---
    def create
        byebug
        newUser = User.create(username: params[:username])

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Roy"], ["LIMIT", 1]]
---
    def login
        user = User.all.find_by(username: params[:username])