app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Roy"], ["LIMIT", 1]]
---
    def login
        user = User.all.find_by(username: params[:username])